# Вводится число 0 или 1, необходимо вывести 1 или 0 соответственно.
# ===========================
# Формат ввода
#
# Число 0 или 1.
# ===========================
# Формат вывода
#
# Число 0 или 1.
# ===========================
# Примеры
#
# Тест 1
# Входные данные:
# 0
# Вывод программы:
# 1

n = int(input("Введите число 1 или 0: "))

if n == 1:
    print(0)

if n == 0:
    print(1)