# Назовем число палиндромом, если оно не меняется при перестановке его цифр в обратном порядке. Напишите программу,
# которая по заданному числу K выводит количество натуральных палиндромов, не превосходящих K.
# 
# Формат ввода
# 
# Задано единственное число K (1≤K≤100000).
# 
# Формат вывода
# 
# Необходимо вывести количество натуральных палиндромов, не превосходящих K.
# 
# Примеры
#
# Тест 1
# Входные данные:
# 1
# 
# 
# Вывод программы:
# 1
# 
# 
# 
# 
# Тест 2
# Входные данные:
# 100
# 
# 
# Вывод программы:
# 18
# 
# 
# 
# 
# Тест 3
# Входные данные:
# 10
# 
# 
# Вывод программы:
# 9